app/views/users/show.html.erb

							<td style><%= book.body %></td>
							<td style><%= "#{@book.book_comments.count} コメント" %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 2]]