app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
								    	<i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"></i>
								    	<%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
								    	<i class="glyphicon glyphicon-heart" aria-hidden="true"></i>
								   		<%= book.favorites.count %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
							</td>
							<td style><%= "#{book.book_comments.count} コメント" %></td>