app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 8]]
---
								    	<i class="glyphicon glyphicon-heart" aria-hidden="true" style="color: red;"></i>
								    	<%= @book_find.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 8]]
---
								    	<i class="glyphicon glyphicon-heart" aria-hidden="true"></i>
								   		<%= @book_find.favorites.count %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 8]]
---

							<td style><%= "#{@book.book_comments.count} コメント" %>