app/controllers/book_comments_controller.rb

	def create
	 	@book_find = Book.find(params[:book_id])
	 	@comment = @book_find.book_comments.new(comment_params)
	 	@comment.user_id = current_user.id #同じ変数を使い、足りない情報を追加している
	 	@comments = BookComment.where(book_id: @book_find.id)
	 	if @comment.save
	 	   redirect_to book_path(@book_find.id)
	 	else
	 	   @user = User.find(@book_find.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "ここ"], ["user_id", 2], ["book_id", 1], ["created_at", "2020-06-02 12:08:13.754769"], ["updated_at", "2020-06-02 12:08:13.754769"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

	def destroy
		@comment = BookComment.find(params[:id])
        if @comment.user_id == current_user.id
           @comment.destroy
	       redirect_to request.referer
        else
           @book_find = Book.find(params[:book_id])
           @user = User.find(@book_find.user_id)
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 8]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]