app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["book_id", 1], ["created_at", "2020-06-02 09:29:40.974964"], ["updated_at", "2020-06-02 09:29:40.974964"]]
---
	def create
		@book = Book.find(params[:book_id])
		@favorite = @book.favorites.new(user_id: current_user.id) #2,3行目が大事（ネスト型のため）
        #@favorite = Favorites.new(user_id: current_user.id, book_id: params[:book.id])
        @favorite.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["book_id", 1], ["user_id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
    def destroy
    	@book = Book.find(params[:book_id])
        @favorite = @book.favorites.find_by(user_id: current_user.id)
        @favorite.destroy