app/controllers/users_controller.rb

  def index

  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。
---
SELECT "users"."id" FROM "users"

  def follows
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]